In [1]:
import pandas as pd
import logging

logging.basicConfig(level=logging.INFO)

In [2]:
url = "https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes"

In [3]:
def scrape(url):
    logging.info(f"Scraping website with url: '{url}' ...")
    return pd.read_html(url, header=None)

In [4]:
dfs = scrape(url)[2]

INFO:root:Scraping website with url: 'https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes' ...

In [5]:
dfs

,No.,Nama,Kekayaan bersih (USD),Usia,Kebangsaan,Sumber kekayaan
0,NaN,Jeff Bezos,$113 miliar,56,Amerika Serikat,Amazon
1,NaN,Bill Gates,$98 miliar,64,Amerika Serikat,Microsoft
2,NaN,Bernard Arnault & family,$76 miliar,71,Prancis,LVMH
3,NaN,Warren Buffett,$67.5 miliar,89,Amerika Serikat,Berkshire Hathaway
4,NaN,Larry Ellison,$59 miliar,75,Amerika Serikat,Oracle Corporation
5,NaN,Amancio Ortega,$55.1 miliar,84,Spanyol,"Inditex, Zara"
6,NaN,Mark Zuckerberg,$54.7 miliar,35,Amerika Serikat,"Facebook, Inc."
7,NaN,Jim Walton,$54.6 miliar,71,Amerika Serikat,Walmart
8,NaN,Alice Walton,$54.4 miliar,70,Amerika Serikat,Walmart
9,NaN,S. Robson Walton,$54.1 miliar,77,Amerika Serikat,Walmart

In [6]:
import re

In [7]:
def is_money_miliar(string_money):
    return string_money.lower().endswith("miliar")

In [8]:
def transform_money_format(string_money):
    half_clean_string = string_money.lower().replace(",", ".").replace(" ", "").replace("$", "")
    return re.sub(r"[?\[M\]miliar|\[J\]juta]", "", half_clean_string)

In [9]:
dfs['No.'] = dfs.reset_index().index + 1

In [10]:
def transform(df, tahun):
    logging.info("Transforming DataFrame ...")
    
    columns_mapping = {
        "No.": "nomor_urut",
        "Nama": "nama",
        "Kekayaan bersih (USD)": "kekayaan_bersih_usd",
        "Usia": "usia",
        "Kebangsaan": "kebangsaan",
        "Sumber kekayaan": "sumber_kekayaan"
    }
    
    renamed_df = df.rename(columns=columns_mapping)
    renamed_df["tahun"] = tahun
    
    renamed_df["kekayaan_bersih_usd_juta"] = renamed_df["kekayaan_bersih_usd"].apply(
        lambda value: float(transform_money_format(value)) * 1000 if is_money_miliar(value) else float(transform_money_format(value))
    )
    
    return renamed_df[["nomor_urut", "tahun", "nama", "kekayaan_bersih_usd_juta", "usia", "kebangsaan", "sumber_kekayaan"]]

In [11]:
df_2021 = transform(dfs, 2021)

INFO:root:Transforming DataFrame ...

In [12]:
df_2021

,nomor_urut,tahun,nama,kekayaan_bersih_usd_juta,usia,kebangsaan,sumber_kekayaan
0,1,2021,Jeff Bezos,113000.0,56,Amerika Serikat,Amazon
1,2,2021,Bill Gates,98000.0,64,Amerika Serikat,Microsoft
2,3,2021,Bernard Arnault & family,76000.0,71,Prancis,LVMH
3,4,2021,Warren Buffett,67500.0,89,Amerika Serikat,Berkshire Hathaway
4,5,2021,Larry Ellison,59000.0,75,Amerika Serikat,Oracle Corporation
5,6,2021,Amancio Ortega,55100.0,84,Spanyol,"Inditex, Zara"
6,7,2021,Mark Zuckerberg,54700.0,35,Amerika Serikat,"Facebook, Inc."
7,8,2021,Jim Walton,54600.0,71,Amerika Serikat,Walmart
8,9,2021,Alice Walton,54400.0,70,Amerika Serikat,Walmart
9,10,2021,S. Robson Walton,54100.0,77,Amerika Serikat,Walmart

In [13]:
from sqlalchemy import create_engine

In [14]:
DB_NAME = "postgres"
DB_USER = "user1"
DB_PASSWORD = "user1"
DB_HOST = "104.197.148.144"
DB_PORT = "5432"
CONNECTION_STRING = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
TABLE_NAME = "Nadira_orang_terkaya_forbes"

In [15]:
CONNECTION_STRING

'postgresql://user1:user1@104.197.148.144:5432/postgres'

In [20]:
def write_to_postgres(df, db_name, table_name, connection_string):
    engine = create_engine(connection_string)
    logging.info(f"Writing dataframe to database: '{db_name}', tablee: '{table_name}', ...")
    df.to_sql(name = table_name, con=engine, if_exists="replace", index=False)

In [19]:
write_to_postgres(df=df_2021, db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Writing dataframe to database: 'postgres', tablee: 'Nadira_orang_terkaya_forbes', ...